[
  {
    "full_name": "deepseek-ai/DeepSeek-V3.1",
    "display_name": "DeepSeek-V3.1",
    "description": "DeepSeek-V3.1 is post-trained on the top of DeepSeek-V3.1-Base, which is built upon the original V3 base checkpoint through a two-phase long context extension approach, following the methodology outlined in the original DeepSeek-V3 report. We have expanded our dataset by collecting additional long documents and substantially extending both training phases. The 32K extension phase has been increased 10-fold to 630B tokens, while the 128K extension phase has been extended by 3.3x to 209B tokens. Additionally, DeepSeek-V3.1 is trained using the UE8M0 FP8 scale data format to ensure compatibility with microscaling data formats.",
    "type": "text-generation"
  },
  {
    "full_name": "openai/gpt-oss-120b",
    "display_name": "GPT-OSS-120B",
    "description": "gpt-oss-120b is an open-weight, 117B-parameter Mixture-of-Experts (MoE) language model from OpenAI designed for high-reasoning, agentic, and general-purpose production use cases. The model supports configurable reasoning depth, full chain-of-thought access, and native tool use, including function calling, browsing, and structured output generation.",
    "type": "text-generation"
  },
  {
    "full_name": "zai-org/GLM-4.5V",
    "display_name": "GLM-4.5V",
    "description": "GLM-4.5V is based on ZhipuAI's next-generation flagship text foundation model GLM-4.5-Air (106B parameters, 12B active). It continues the technical approach of GLM-4.1V-Thinking, achieving SOTA performance among models of the same scale on 42 public vision-language benchmarks. It covers common tasks such as image, video, and document understanding, as well as GUI agent operations.",
    "type": "text-generation"
  },
  {
    "full_name": "openai/gpt-oss-20b",
    "display_name": "GPT-OSS-20B",
    "description": "gpt-oss-20b is an open-weight 21B parameter model released by OpenAI under the Apache 2.0 license. It uses a Mixture-of-Experts (MoE) architecture with 3.6B active parameters per forward pass, optimized for lower-latency inference. The model is trained in OpenAI's Harmony response format and supports reasoning level configuration, fine-tuning, and agentic capabilities including function calling, tool use, and structured outputs.",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-Coder-480B-A35B-Instruct-Turbo",
    "display_name": "Qwen3-Coder-480B-A35B-Instruct-Turbo",
    "description": "Qwen3-Coder-480B-A35B-Instruct is the Qwen3's most agentic code model, featuring Significant Performance on Agentic Coding, Agentic Browser-Use and other foundational coding tasks, achieving results comparable to Claude Sonnet.",
    "type": "text-generation"
  },
  {
    "full_name": "zai-org/GLM-4.5",
    "display_name": "GLM-4.5",
    "description": "The GLM-4.5 series models are foundation models designed for intelligent agents. GLM-4.5 has 355 billion total parameters with 32 billion active parameters, while GLM-4.5-Air adopts a more compact design with 106 billion total parameters and 12 billion active parameters. GLM-4.5 models unify reasoning, coding, and intelligent agent capabilities to meet the complex demands of intelligent agent applications.",
    "type": "text-generation"
  },
  {
    "full_name": "moonshotai/Kimi-K2-Instruct",
    "display_name": "Kimi-K2-Instruct",
    "description": "Kimi K2 is a large-scale Mixture-of-Experts (MoE) language model developed by Moonshot AI, featuring 1 trillion total parameters with 32 billion active per forward pass. It is optimized for agentic capabilities, including advanced tool use, reasoning, and code synthesis. Kimi K2 excels across a broad range of benchmarks, particularly in coding (LiveCodeBench, SWE-bench), reasoning (ZebraLogic, GPQA), and tool-use (Tau2, AceBench) tasks.",
    "type": "text-generation"
  },
  {
    "full_name": "allenai/olmOCR-7B-0725-FP8",
    "display_name": "olmOCR-7B-0725-FP8",
    "description": "olmOCR is a specialized AI tool that converts PDF documents into clean, structured text while preserving important formatting and layout information. What makes olmOCR particularly valuable for developers is its ability to handle challenging PDFs that traditional OCR tools struggle with—including complex layouts, poor-quality scans, handwritten text, and documents with mixed content types. Built on a fine-tuned 7B vision-language model, olmOCR provides enterprise-grade accuracy and reliability.",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-235B-A22B-Thinking-2507",
    "display_name": "Qwen3-235B-A22B-Thinking-2507",
    "description": "Qwen3-235B-A22B-Thinking-2507 is the Qwen3's new model with scaling the thinking capability of Qwen3-235B-A22B, improving both the quality and depth of reasoning.",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-Coder-480B-A35B-Instruct",
    "display_name": "Qwen3-Coder-480B-A35B-Instruct",
    "description": "Qwen3-Coder-480B-A35B-Instruct is the Qwen3's most agentic code model, featuring Significant Performance on Agentic Coding, Agentic Browser-Use and other foundational coding tasks, achieving results comparable to Claude Sonnet.",
    "type": "text-generation"
  },
  {
    "full_name": "zai-org/GLM-4.5-Air",
    "display_name": "GLM-4.5-Air",
    "description": "The GLM-4.5 series models are foundation models designed for intelligent agents. GLM-4.5 has 355 billion total parameters with 32 billion active parameters, while GLM-4.5-Air adopts a more compact design with 106 billion total parameters and 12 billion active parameters. GLM-4.5 models unify reasoning, coding, and intelligent agent capabilities to meet the complex demands of intelligent agent applications.",
    "type": "text-generation"
  },
  {
    "full_name": "mistralai/Voxtral-Small-24B-2507",
    "display_name": "Voxtral-Small-24B-2507",
    "description": "Voxtral Small is an enhancement of Mistral Small 3, incorporating state-of-the-art audio input capabilities while retaining best-in-class text performance. It excels at speech transcription, translation and audio understanding.",
    "type": "automatic-speech-recognition"
  },
  {
    "full_name": "mistralai/Voxtral-Mini-3B-2507",
    "display_name": "Voxtral-Mini-3B-2507",
    "description": "Voxtral Mini is an enhancement of Ministral 3B, incorporating state-of-the-art audio input capabilities while retaining best-in-class text performance. It excels at speech transcription, translation and audio understanding.",
    "type": "automatic-speech-recognition"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-R1-0528-Turbo",
    "display_name": "DeepSeek-R1-0528-Turbo",
    "description": "The DeepSeek R1 0528 turbo model is a state of the art reasoning model that can generate very quick responses",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-235B-A22B-Instruct-2507",
    "display_name": "Qwen3-235B-A22B-Instruct-2507",
    "description": "Qwen3-235B-A22B-Instruct-2507 is the updated version of the Qwen3-235B-A22B non-thinking mode, featuring Significant improvements in general capabilities, including instruction following, logical reasoning, text comprehension, mathematics, science, coding and tool usage.",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-30B-A3B",
    "display_name": "Qwen3-30B-A3B",
    "description": "Qwen3 is the latest generation of large language models in Qwen series, offering a comprehensive suite of dense and mixture-of-experts (MoE) models. Built upon extensive training, Qwen3 delivers groundbreaking advancements in reasoning, instruction-following, agent capabilities, and multilingual support",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-32B",
    "display_name": "Qwen3-32B",
    "description": "Qwen3 is the latest generation of large language models in Qwen series, offering a comprehensive suite of dense and mixture-of-experts (MoE) models. Built upon extensive training, Qwen3 delivers groundbreaking advancements in reasoning, instruction-following, agent capabilities, and multilingual support",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/Qwen3-14B",
    "display_name": "Qwen3-14B",
    "description": "Qwen3 is the latest generation of large language models in Qwen series, offering a comprehensive suite of dense and mixture-of-experts (MoE) models. Built upon extensive training, Qwen3 delivers groundbreaking advancements in reasoning, instruction-following, agent capabilities, and multilingual support.",
    "type": "text-generation"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-V3-0324-Turbo",
    "display_name": "DeepSeek-V3-0324-Turbo",
    "description": "",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-4-Maverick-17B-128E-Instruct-Turbo",
    "display_name": "Llama-4-Maverick-17B-128E-Instruct-Turbo",
    "description": "The Llama 4 collection of models are natively multimodal AI models that enable text and multimodal experiences. These models leverage a mixture-of-experts architecture to offer industry-leading performance in text and image understanding. Llama 4 Maverick, a 17 billion parameter model with 128 experts",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-4-Maverick-17B-128E-Instruct-FP8",
    "display_name": "Llama-4-Maverick-17B-128E-Instruct-FP8",
    "description": "The Llama 4 collection of models are natively multimodal AI models that enable text and multimodal experiences. These models leverage a mixture-of-experts architecture to offer industry-leading performance in text and image understanding. Llama 4 Maverick, a 17 billion parameter model with 128 experts",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-4-Scout-17B-16E-Instruct",
    "display_name": "Llama-4-Scout-17B-16E-Instruct",
    "description": "The Llama 4 collection of models are natively multimodal AI models that enable text and multimodal experiences. These models leverage a mixture-of-experts architecture to offer industry-leading performance in text and image understanding. Llama 4 Scout, a 17 billion parameter model with 16 experts",
    "type": "text-generation"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-R1-0528",
    "display_name": "DeepSeek-R1-0528",
    "description": "The DeepSeek R1 model has undergone a minor version upgrade, with the current version being DeepSeek-R1-0528.",
    "type": "text-generation"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-V3-0324",
    "display_name": "DeepSeek-V3-0324",
    "description": "DeepSeek-V3-0324, a strong Mixture-of-Experts (MoE) language model with 671B total parameters with 37B activated for each token, an improved iteration over DeepSeek-V3.",
    "type": "text-generation"
  },
  {
    "full_name": "mistralai/Devstral-Small-2507",
    "display_name": "Devstral-Small-2507",
    "description": "Devstral is an agentic LLM for software engineering tasks, making it a great choice for software engineering agents.",
    "type": "text-generation"
  },
  {
    "full_name": "mistralai/Mistral-Small-3.2-24B-Instruct-2506",
    "display_name": "Mistral-Small-3.2-24B-Instruct-2506",
    "description": "Mistral-Small-3.2-24B-Instruct is a drop-in upgrade over the 3.1 release, with markedly better instruction following, roughly half the infinite-generation errors, and a more robust function-calling interface—while otherwise matching or slightly improving on all previous text and vision benchmarks.",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-Guard-4-12B",
    "display_name": "Llama-Guard-4-12B",
    "description": "Llama Guard 4 is a natively multimodal safety classifier with 12 billion parameters trained jointly on text and multiple images. Llama Guard 4 is a dense architecture pruned from the Llama 4 Scout pre-trained model and fine-tuned for content safety classification. Similar to previous versions, it can be used to classify content in both LLM inputs (prompt classification) and in LLM responses (response classification).",
    "type": "text-generation"
  },
  {
    "full_name": "Qwen/QwQ-32B",
    "display_name": "QwQ-32B",
    "description": "QwQ is the reasoning model of the Qwen series. Compared with conventional instruction-tuned models, QwQ, which is capable of thinking and reasoning, can achieve significantly enhanced performance in downstream tasks, especially hard problems. QwQ-32B is the medium-sized reasoning model, which is capable of achieving competitive performance against state-of-the-art reasoning models, e.g., DeepSeek-R1, o1-mini.",
    "type": "text-generation"
  },
  {
    "full_name": "anthropic/claude-4-opus",
    "display_name": "Claude-4-Opus",
    "description": "Anthropic's most powerful model yet and the state-of-the-art coding model. It delivers sustained performance on long-running tasks that require focused effort and thousands of steps, significantly expanding what AI agents can solve. Claude Opus 4 is ideal for powering frontier agent products and features.",
    "type": "text-generation"
  },
  {
    "full_name": "anthropic/claude-4-sonnet",
    "display_name": "Claude-4-Sonnet",
    "description": "Anthropic's mid-size model with superior intelligence for high-volume uses in coding, in-depth research, agents, & more.",
    "type": "text-generation"
  },
  {
    "full_name": "google/gemini-2.5-flash",
    "display_name": "Gemini-2.5-Flash",
    "description": "Gemini 2.5 Flash is Google's latest thinking model, designed to tackle increasingly complex problems. It's capable of reasoning through their thoughts before responding, resulting in enhanced performance and improved accuracy. Gemini 2.5 Flash: best for balancing reasoning and speed.",
    "type": "text-generation"
  },
  {
    "full_name": "google/gemini-2.5-pro",
    "display_name": "Gemini-2.5-Pro",
    "description": "Gemini 2.5 Pro is Google's the most advanced thinking model, designed to tackle increasingly complex problems. Gemini 2.5 Pro leads common benchmarks by meaningful margins and showcases strong reasoning and code capabilities. Gemini 2.5 models are thinking models, capable of reasoning through their thoughts before responding, resulting in enhanced performance and improved accuracy.",
    "type": "text-generation"
  },
  {
    "full_name": "google/gemma-3-27b-it",
    "display_name": "Gemma-3-27B-IT",
    "description": "Gemma 3 introduces multimodality, supporting vision-language input and text outputs. It handles context windows up to 128k tokens, understands over 140 languages, and offers improved math, reasoning, and chat capabilities, including structured outputs and function calling. Gemma 3 27B is Google's latest open source model, successor to Gemma 2",
    "type": "text-generation"
  },
  {
    "full_name": "google/gemma-3-12b-it",
    "display_name": "Gemma-3-12B-IT",
    "description": "Gemma 3 introduces multimodality, supporting vision-language input and text outputs. It handles context windows up to 128k tokens, understands over 140 languages, and offers improved math, reasoning, and chat capabilities, including structured outputs and function calling. Gemma 3-12B is Google's latest open source model, successor to Gemma 2",
    "type": "text-generation"
  },
  {
    "full_name": "google/gemma-3-4b-it",
    "display_name": "Gemma-3-4B-IT",
    "description": "Gemma 3 introduces multimodality, supporting vision-language input and text outputs. It handles context windows up to 128k tokens, understands over 140 languages, and offers improved math, reasoning, and chat capabilities, including structured outputs and function calling. Gemma 3-12B is Google's latest open source model, successor to Gemma 2",
    "type": "text-generation"
  },
  {
    "full_name": "hexgrad/Kokoro-82M",
    "display_name": "Kokoro-82M",
    "description": "Kokoro is an open-weight TTS model with 82 million parameters. Despite its lightweight architecture, it delivers comparable quality to larger models while being significantly faster and more cost-efficient. With Apache-licensed weights, Kokoro can be deployed anywhere from production environments to personal projects.",
    "type": "text-to-speech"
  },
  {
    "full_name": "canopylabs/orpheus-3b-0.1-ft",
    "display_name": "Orpheus-3B-0.1-FT",
    "description": "Orpheus TTS is a state-of-the-art, Llama-based Speech-LLM designed for high-quality, empathetic text-to-speech generation. This model has been finetuned to deliver human-level speech synthesis, achieving exceptional clarity, expressiveness, and real-time streaming performances.",
    "type": "text-to-speech"
  },
  {
    "full_name": "sesame/csm-1b",
    "display_name": "CSM-1B",
    "description": "CSM (Conversational Speech Model) is a speech generation model from Sesame that generates RVQ audio codes from text and audio inputs. The model architecture employs a Llama backbone and a smaller audio decoder that produces Mimi audio codes.",
    "type": "text-to-speech"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-R1-Distill-Llama-70B",
    "display_name": "DeepSeek-R1-Distill-Llama-70B",
    "description": "DeepSeek-R1-Distill-Llama-70B is a highly efficient language model that leverages knowledge distillation to achieve state-of-the-art performance. This model distills the reasoning patterns of larger models into a smaller, more agile architecture, resulting in exceptional results on benchmarks like AIME 2024, MATH-500, and LiveCodeBench. With 70 billion parameters, DeepSeek-R1-Distill-Llama-70B offers a unique balance of accuracy and efficiency.",
    "type": "text-generation"
  },
  {
    "full_name": "deepseek-ai/DeepSeek-V3",
    "display_name": "DeepSeek-V3",
    "description": "DeepSeek-V3, a strong Mixture-of-Experts (MoE) language model with 671B total parameters with 37B activated for each token. To achieve efficient inference and cost-effective training, DeepSeek-V3 adopts Multi-head Latent Attention (MLA) and DeepSeekMoE architectures, which were thoroughly validated in DeepSeek-V2.",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-3.3-70B-Instruct-Turbo",
    "display_name": "Llama-3.3-70B-Instruct-Turbo",
    "description": "Llama 3.3-70B Turbo is a highly optimized version of the Llama 3.3-70B model, utilizing FP8 quantization to deliver significantly faster inference speeds with a minor trade-off in accuracy. The model is designed to be helpful, safe, and flexible, with a focus on responsible deployment and mitigating potential risks such as bias, toxicity, and misinformation.",
    "type": "text-generation"
  },
  {
    "full_name": "meta-llama/Llama-3.3-70B-Instruct",
    "display_name": "Llama-3.3-70B-Instruct",
    "description": "Llama 3.3-70B is a multilingual LLM trained on a massive dataset of 15 trillion tokens, fine-tuned for instruction-following and conversational dialogue. The model is designed to be helpful, safe, and flexible, with a focus on responsible deployment and mitigating potential risks such as bias, toxicity, and misinformation.",
    "type": "text-generation"
  },
  {
    "full_name": "microsoft/phi-4",
    "display_name": "Phi-4",
    "description": "Phi-4 is a model built upon a blend of synthetic datasets, data from filtered public domain websites, and acquired academic books and Q&A datasets. The goal of this approach was to ensure that small capable models were trained with data focused on high quality and advanced reasoning.",
    "type": "text-generation"
  },
  {
    "full_name": "openai/whisper-large-v3-turbo",
    "display_name": "Whisper-Large-V3-Turbo",
    "description": "Whisper is a state-of-the-art model for automatic speech recognition (ASR) and speech translation, proposed in the paper \"Robust Speech Recognition via Large-Scale Weak Supervision\" by Alec Radford et al. from OpenAI. Trained on >5M hours of labeled data, Whisper demonstrates a strong ability to generalise to many datasets and domains in a zero-shot setting.",
    "type": "automatic-speech-recognition"
  }
]